loadtest/results/20260922-115848/1-no-cache.txt
Running 1m test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 100 connections
  Thread calibration: mean lat.: 153.456ms, rate sampling interval: 438ms
  Thread calibration: mean lat.: 168.541ms, rate sampling interval: 606ms
  Thread calibration: mean lat.: 156.839ms, rate sampling interval: 435ms
  Thread calibration: mean lat.: 220.440ms, rate sampling interval: 1068ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   241.86ms  249.09ms   1.37s    85.75%
    Req/Sec   125.25     28.42   227.00     76.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  126.21ms
 75.000%  278.27ms
 90.000%  655.36ms
 99.000%    1.08s 
 99.900%    1.27s 
 99.990%    1.36s 
 99.999%    1.38s 
100.000%    1.38s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      74.303     0.000000            1         1.00
      84.479     0.100000         2531         1.11
      89.407     0.200000         5039         1.25
      94.719     0.300000         7553         1.43
     104.895     0.400000        10045         1.67
     126.207     0.500000        12553         2.00
     138.239     0.550000        13805         2.22
     152.191     0.600000        15070         2.50
     165.631     0.650000        16323         2.86
     187.775     0.700000        17572         3.33
     278.271     0.750000        18826         4.00
     318.463     0.775000        19453         4.44
     371.711     0.800000        20082         5.00
     423.935     0.825000        20709         5.71
     478.975     0.850000        21335         6.67
     533.503     0.875000        21964         8.00
     609.279     0.887500        22277         8.89
     655.359     0.900000        22593        10.00
     703.487     0.912500        22906        11.43
     756.223     0.925000        23219        13.33
     815.103     0.937500        23535        16.00
     850.431     0.943750        23689        17.78
     880.127     0.950000        23846        20.00
     903.167     0.956250        24007        22.86
     916.991     0.962500        24166        26.67
     930.303     0.968750        24316        32.00
     941.567     0.971875        24396        35.56
     951.807     0.975000        24475        40.00
     969.727     0.978125        24551        45.71
     992.767     0.981250        24630        53.33
    1017.343     0.984375        24708        64.00
    1040.895     0.985938        24748        71.11
    1059.839     0.987500        24788        80.00
    1071.103     0.989062        24828        91.43
    1083.391     0.990625        24866       106.67
    1097.727     0.992188        24907       128.00
    1103.871     0.992969        24925       142.22
    1112.063     0.993750        24944       160.00
    1136.639     0.994531        24963       182.86
    1180.671     0.995313        24991       213.33
    1182.719     0.996094        25020       256.00
    1182.719     0.996484        25020       284.44
    1183.743     0.996875        25032       320.00
    1183.743     0.997266        25032       365.71
    1184.767     0.997656        25045       426.67
    1185.791     0.998047        25057       512.00
    1185.791     0.998242        25057       568.89
    1196.031     0.998437        25061       640.00
    1218.559     0.998633        25066       731.43
    1249.279     0.998828        25071       853.33
    1272.831     0.999023        25076      1024.00
    1278.975     0.999121        25078      1137.78
    1285.119     0.999219        25081      1280.00
    1292.287     0.999316        25083      1462.86
    1305.599     0.999414        25086      1706.67
    1315.839     0.999512        25088      2048.00
    1318.911     0.999561        25089      2275.56
    1329.151     0.999609        25091      2560.00
    1334.271     0.999658        25092      2925.71
    1340.415     0.999707        25093      3413.33
    1345.535     0.999756        25094      4096.00
    1350.655     0.999780        25095      4551.11
    1355.775     0.999805        25096      5120.00
    1355.775     0.999829        25096      5851.43
    1360.895     0.999854        25097      6826.67
    1360.895     0.999878        25097      8192.00
    1367.039     0.999890        25098      9102.22
    1367.039     0.999902        25098     10240.00
    1367.039     0.999915        25098     11702.86
    1372.159     0.999927        25099     13653.33
    1372.159     0.999939        25099     16384.00
    1372.159     0.999945        25099     18204.44
    1372.159     0.999951        25099     20480.00
    1372.159     0.999957        25099     23405.71
    1375.231     0.999963        25100     27306.67
    1375.231     1.000000        25100          inf
#[Mean    =      241.863, StdDeviation   =      249.087]
#[Max     =     1374.208, Total count    =        25100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29628 requests in 1.00m, 10.09MB read
  Non-2xx or 3xx responses: 3770
Requests/sec:    493.09
Transfer/sec:    172.02KB
------------------------------
X-Cache  HIT=0  MISS=0  BYPASS=25858  writes=0  http_errors=3770
Socket errors: connect=0 read=0 write=0 timeout=0
p50      126.21 ms
p90      655.36 ms
p99     1075.20 ms
p99.9   1268.73 ms