loadtest/results/20260922-115848/2-cache-aside.txt
Running 1m test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 100 connections
  Thread calibration: mean lat.: 109.464ms, rate sampling interval: 324ms
  Thread calibration: mean lat.: 109.798ms, rate sampling interval: 325ms
  Thread calibration: mean lat.: 110.903ms, rate sampling interval: 330ms
  Thread calibration: mean lat.: 110.134ms, rate sampling interval: 325ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   145.44ms  238.54ms   4.08s    96.98%
    Req/Sec   124.71     24.27   246.00     73.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   95.74ms
 75.000%  137.34ms
 90.000%  170.24ms
 99.000%    1.35s 
 99.900%    3.18s 
 99.990%    3.85s 
 99.999%    4.08s 
100.000%    4.08s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      72.831     0.000000            1         1.00
      81.727     0.100000         2556         1.11
      84.095     0.200000         4990         1.25
      86.655     0.300000         7485         1.43
      90.111     0.400000        10004         1.67
      95.743     0.500000        12472         2.00
     100.351     0.550000        13713         2.22
     107.455     0.600000        14964         2.50
     116.735     0.650000        16211         2.86
     126.591     0.700000        17452         3.33
     137.343     0.750000        18702         4.00
     142.591     0.775000        19332         4.44
     147.839     0.800000        19943         5.00
     153.343     0.825000        20570         5.71
     158.719     0.850000        21189         6.67
     164.223     0.875000        21814         8.00
     167.167     0.887500        22123         8.89
     170.239     0.900000        22440        10.00
     174.335     0.912500        22753        11.43
     180.991     0.925000        23058        13.33
     195.327     0.937500        23370        16.00
     207.231     0.943750        23528        17.78
     226.559     0.950000        23682        20.00
     254.335     0.956250        23837        22.86
     295.423     0.962500        23995        26.67
     372.991     0.968750        24149        32.00
     420.607     0.971875        24226        35.56
     468.991     0.975000        24304        40.00
     542.207     0.978125        24382        45.71
     698.879     0.981250        24460        53.33
     895.999     0.984375        24538        64.00
    1001.471     0.985938        24577        71.11
    1133.567     0.987500        24616        80.00
    1260.543     0.989062        24655        91.43
    1402.879     0.990625        24694       106.67
    1556.479     0.992188        24733       128.00
    1666.047     0.992969        24754       142.22
    1767.423     0.993750        24772       160.00
    1888.255     0.994531        24791       182.86
    2073.599     0.995313        24811       213.33
    2285.567     0.996094        24830       256.00
    2390.015     0.996484        24840       284.44
    2504.703     0.996875        24850       320.00
    2615.295     0.997266        24859       365.71
    2746.367     0.997656        24869       426.67
    2914.303     0.998047        24879       512.00
    2961.407     0.998242        24884       568.89
    3033.087     0.998437        24889       640.00
    3078.143     0.998633        24893       731.43
    3151.871     0.998828        24898       853.33
    3203.071     0.999023        24903      1024.00
    3250.175     0.999121        24906      1137.78
    3266.559     0.999219        24908      1280.00
    3311.615     0.999316        24910      1462.86
    3366.911     0.999414        24913      1706.67
    3391.487     0.999512        24915      2048.00
    3438.591     0.999561        24917      2275.56
    3450.879     0.999609        24918      2560.00
    3512.319     0.999658        24919      2925.71
    3553.279     0.999707        24920      3413.33
    3627.007     0.999756        24921      4096.00
    3665.919     0.999780        24922      4551.11
    3715.071     0.999805        24923      5120.00
    3715.071     0.999829        24923      5851.43
    3733.503     0.999854        24924      6826.67
    3733.503     0.999878        24924      8192.00
    3850.239     0.999890        24925      9102.22
    3850.239     0.999902        24925     10240.00
    3850.239     0.999915        24925     11702.86
    3962.879     0.999927        24926     13653.33
    3962.879     0.999939        24926     16384.00
    3962.879     0.999945        24926     18204.44
    3962.879     0.999951        24926     20480.00
    3962.879     0.999957        24926     23405.71
    4077.567     0.999963        24927     27306.67
    4077.567     1.000000        24927          inf
#[Mean    =      145.444, StdDeviation   =      238.540]
#[Max     =     4075.520, Total count    =        24927]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29945 requests in 1.00m, 10.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
  Non-2xx or 3xx responses: 459
Requests/sec:    498.89
Transfer/sec:    177.73KB
------------------------------
X-Cache  HIT=23911  MISS=5575  BYPASS=0  writes=0  http_errors=459
Cache hit ratio: 81.09%
Socket errors: connect=0 read=0 write=0 timeout=2
p50       95.74 ms
p90      170.24 ms
p99     1351.68 ms
p99.9   3178.49 ms